import { createSlice } from "@reduxjs/toolkit";

const initialState = [
  {
    title: "منابع اطلاعاتی",
    firstList: [
      {
        list: "شبکه کدال - مرجع اطلاعات مالی شرکت‌های پذیرفته‌شده در بورس و فرابورس",
      },
      {
        list: "سایت شرکت مدیریت فناوری بورس اوراق بهادار - مرجع اطلاعات معاملاتی شرکت‌های پذیرفته‌شده در بورس و فرابورس",
      },
      {
        list: "روزنامه رسمی کشور جهت استخراج اطلاعاتی ثبتی شرکت‌های بورسی",
      },
      {
        list: "خبرگزاری فارس ایرنا و دنیای اقتصاد",
      },
      {
        list: "سایت فلزات بورس لندن برای تأمین اطلاعات قیمت فلزات اساسی",
      },
      {
        list: "سایت رسمی بورس کالای ایران جهت ارائه اطلاعات قیمت معاملاتی محصولات",
      },
    ],
  },
  {
    title: "معیار‌های انتخاب منابع اطلاعاتی",
    firstContent:
      "طبق ماده ۱۱ بند ۱ دستورالعمل تأسیس و فعالیت شرکت‌های پردازش اطلاعات مالی به شرح زیر:",
    secondContent:
      "شرکت پردازش اطلاعات مالی مبنا از منابعی جهت گردآوری اطلاعات استفاده می‌کند که دارای ویژگی‌های زیر باشند:",
    firstList: [
      {
        list: "«معیارهایی که پردازشگر اطلاعات مالی در انتخاب منابع اطلاعاتی خود در نظر می‌گیرد به‌طوری که منابع اطلاعاتی انتخاب‌شده براساس این معیارها، از نظر پردازشگر اطلاعات مالی، موثق باشند.»",
      },
    ],
    secondList: [
      {
        list: "منبع موردنظر تحت نظارت یکی از سازمان‌های معتبر دولتی یا بین‌المللی باشد.",
      },
      {
        list: "منبع موردنظر تحت عنوان خبرگزاری، روزنامه یا نشریه زیر نظر وزارت فرهنگ و ارشاد اسلامی فعالیت کند.",
      },
      {
        list: "اطلاعات در منبع موردنظر به‌صورت مرتب و بدون وقفه منتشر گردد.",
      },
      {
        list: "در صورت فروش خدمات سایت فروشنده دارای نشان نماد الکترونیکی باشد یا از طریق مراجع دیگر تأیید شده‌باشد.",
      },
      {
        list: "امکان دریافت اطلاعات از طریق وب‌سرویس وجود داشته‌باشد.",
      },
      {
        list: "امکان دریافت اطلاعات در قالب‌هایRSS/XML/CSV وجود داشته‌باشد.",
      },
    ],
  },
  {
    title: "رویه جمع آوری، ثبت و کنترل اطلاعات",
    firstContent: "اطلاعات مورد استفاده در سرویس‌ها و نرم‌افزارهای شرکت پردازش اطلاعات مالی مبنا به دو صورت خودکار و دستی جمع‌آوری و در پایگاه داده شرکت ثبت می‌شوند. این اطلاعات سپس در دو مرحله مجزا به‌صورت خودکار و دستی توسط کارشناسان کنترل و بازبینی می‌شوند.",
  },
  {
    title: "رویه‌های به کار رفته برای حصول اطمینان از صحت استخراج اطلاعات",
    firstContent: "طبق ماده ۱۱ بند ۲ دستورالعمل تأسیس و فعالیت شرکت‌های پردازش اطلاعات مالی به شرح زیر:",
    secondContent: "شرکت پردازش اطلاعات مالی مبنا با روش‌های زیر صحت اطلاعات دریافتی را کنترل می‌کند:",
    firstList: [
      {
        list:"«رویه‌هایی که پردازشگر اطلاعات مالی به‌کار می‌گیرد تا مطمئن شود، اطلاعات مورداستفاده برای ارائه به مشتریان، صرفاً از منابع اطلاعاتی که براساس معیارهای بند ۱ موثق تشخیص داده شده‌اند، جمع‌آوری می‌شوند.»"
      },
    ],
    secondList: [
      {
        list:"بررسی هفتگی آدرس منابع و بانک‌های اطلاعاتی جهت حصول اطمینان از برقرار بودن سرویس."
      },
      {
        list:"کنترل‌های خودکار به‌منظور بررسی در دسترس بودن سرویس‌ها از طریقPING مستمر سرویس‌های مذکور"
      },
      {
        list:"چک کردن اطلاعات دریافتی بر مبنای دامنه مجاز جهت کنترل اشتباهات با دامنه تغییر بالا"
      },
      {
        list:"کنترل روابط ریاضی اطلاعات دریافت‌شده به‌صورت خودکار (صورت‌های مالی)"
      },
    ],
  },
  {
    title: "رویه‌های به کار رفته برای حصول اطمینان از صحت پردازش اطلاعات",
    firstContent: "شرکت پردازش اطلاعات مالی مبنا با روش‌های زیر صحت اطلاعات پردازش‌شده را کنترل می‌کند:",
    firstList: [
      {
        list:"پایش روزانه اطلاعات پردازش‌شده به‌صورت خودکار براساس روابط و فرمول‌های ریاضی تعریف‌شده."
      },
      {
        list:"تعیین درصد انحراف مجاز برای فرمول‌های پردازش‌شده و کنترل موارد خارج از دامنه مجاز به‌صورت هفتگی."
      },
      {
        list:"بررسی حداقل ۵ درصد از اطلاعات پردازش‌شده به‌صورت دستی در پایان هر هفته."
      },
      {
        list:"تعیین تعداد دفعات مجاز برای وقوع انحراف و ثبت رخدادها (درصورتی‌که از تعداد مجاز گذر کند، فرمول‌ها و روابط ریاضی مجدداً بررسی و اصلاحات لازم اعمال می‌شود.)"
      },
    ],
  },
  {
    title: "تضاد منافع",
    firstContent: "طبق ماده ۲۳ بندهای ۶، ۷، ۸ دستورالعمل تأسیس و فعالیت شرکت‌های پردازش اطلاعات مالی به شرح زیر:",
    secondContent: "درحال‌حاضر موارد ذکرشده بند ۶، ۷، ۸ مابین شرکت پردازش اطلاعات مالی مبنا و مشتریان یا اشخاص ثالث وجود ندارد. درصورتی‌که هریک از موارد بالا به‌وجود بیاید موضوع بلافاصله در سایت شرکت افشاء و اطلاع‌رسانی خواهد شد. درصورت‌وجود تضاد منافع، اولویت و حق با مشتری خواهد بود.",
    firstList: [
      {
        list:"«تضاد منافعی که ممکن است به دلیل ارائه خدمات مختلف بین منافع پردازشگر اطلاعات مالی یا اشخاص وابسته و کارکنان وی با مشتریان به‌وجود آید و راه‌های کنترل و حل‌وفصل این تضاد منافع.»"
      },
      {
        list:"«هرگونه رابطه تجاری اساسی که پردازشگر اطلاعات مالی با دیگران دارد و با خدمات پردازش اطلاعات مالی و سایر خدماتی که پردازشگر اطلاعات مالی ارائه می‌دهد در تضاد است.»"
      },
      {
        list:"«هرگونه منافعی که ارائه خدمات پردازش اطلاعات مالی برای اشخاص ثالث به‌استثناء کارکنان شرکت پردازش اطلاعات مالی، به‌وجود می‌آورد.»"
      },
    ],
  },
];

export const accordionsSlice = createSlice({
  name: "accordions",
  initialState: initialState,
  reducers: {},
});

export default accordionsSlice.reducer;
